---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RebarFailures.SketchDimsBWFRemoved
source: html/f0ef02b8-ae35-5636-3160-5c9b38f1044a.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RebarFailures.SketchDimsBWFRemoved Property

The sketch dimensions, that were used to create the sketch, have been removed from the completed bend profile definition.

## Syntax (C#)
```csharp
public static FailureDefinitionId SketchDimsBWFRemoved { get; }
```